AccumulationRegisters/ДополнениеРасчетнойБазыУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДополнениеРасчетнойБазыУдержаний</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОсобыхНачисленийИУдержаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НачисленияУдержанияПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияУдержанияПоСотрудникам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисленияУдержания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеМежрасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияВыполненияРаботВОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Comment>Для строк НДФЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеВзыскания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВРаспределенииНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДохода</Name>
					<Comment>Для строк НДФЛ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДохода</Name>
					<Comment>АПК:58 имя ВидДохода уже занято</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПолученияДохода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетАвансаНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачислениеУдержание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовССотрудниками</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОсобыхНачисленийИУдержаний</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НачисленияУдержанияПоКонтрагентамАкционерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияУдержанияПоКонтрагентамАкционерам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисленияУдержанияПоКонтрагентамАкционерам</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияВыполненияРаботВОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Comment>для строк НДФЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПолученияДохода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачислениеУдержание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОсобыхНачисленийИУдержаний</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДополнениеРасчетнойБазыУдержаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

Процедура ЗаполнитьДополнениеРасчетнойБазыУдержаний(ПараметрыОбновления = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидыНачислений", Обработки.МенеджерРасчетаЗарплаты.ВидыНачисленийДополненияРасчетнойБазыУдержаний());
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДополнениеРасчетнойБазыУдержаний.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТРегистраторы
	               |ИЗ
	               |	РегистрНакопления.ДополнениеРасчетнойБазыУдержаний КАК ДополнениеРасчетнойБазыУдержаний
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НачисленияУдержанияПоСотрудникам.Регистратор КАК Регистратор,
	               |	НачисленияУдержанияПоСотрудникам.Период КАК Период,
	               |	НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
	               |	НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК Начисление,
	               |	НачисленияУдержанияПоСотрудникам.Организация КАК Организация,
	               |	СУММА(НачисленияУдержанияПоСотрудникам.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТДополнениеРасчетнойБазы
	               |ИЗ
	               |	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторы КАК Регистраторы
	               |		ПО НачисленияУдержанияПоСотрудникам.Регистратор = Регистраторы.Регистратор
	               |ГДЕ
	               |	НачисленияУдержанияПоСотрудникам.НачислениеУдержание В(&ВидыНачислений)
	               |	И Регистраторы.Регистратор ЕСТЬ NULL
	               |	И (ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.Регистратор) = ТИП(Документ.КомпенсацияЗаЗадержкуЗарплаты)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.Регистратор) = ТИП(Документ.НачислениеЗарплаты)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.Регистратор) = ТИП(Документ.НачислениеПоДоговорам)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.Регистратор) = ТИП(Документ.ПереносДанных))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачисленияУдержанияПоСотрудникам.Регистратор,
	               |	НачисленияУдержанияПоСотрудникам.Период,
	               |	НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация,
	               |	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо,
	               |	НачисленияУдержанияПоСотрудникам.Сотрудник,
	               |	НачисленияУдержанияПоСотрудникам.Организация,
	               |	НачисленияУдержанияПоСотрудникам.НачислениеУдержание
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НачисленияУдержанияПоСотрудникам.Регистратор,
	               |	НачисленияУдержанияПоСотрудникам.Период,
	               |	НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация,
	               |	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо,
	               |	НачисленияУдержанияПоСотрудникам.Сотрудник,
	               |	НачисленияУдержанияПоСотрудникам.НачислениеУдержание,
	               |	НачисленияУдержанияПоСотрудникам.Организация,
	               |	СУММА(НачисленияУдержанияПоСотрудникам.Сумма)
	               |ИЗ
	               |	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПризПодарок КАК ПризПодарок
	               |		ПО НачисленияУдержанияПоСотрудникам.Регистратор = ПризПодарок.Ссылка
	               |			И (НачисленияУдержанияПоСотрудникам.НачислениеУдержание В (&ВидыНачислений))
	               |			И (НЕ ПризПодарок.ИсключаетсяИзРасчетнойБазыИсполнительныхЛистов)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторы КАК Регистраторы
	               |		ПО НачисленияУдержанияПоСотрудникам.Регистратор = Регистраторы.Регистратор
	               |ГДЕ
	               |	Регистраторы.Регистратор ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачисленияУдержанияПоСотрудникам.Регистратор,
	               |	НачисленияУдержанияПоСотрудникам.Период,
	               |	НачисленияУдержанияПоСотрудникам.Организация.ГоловнаяОрганизация,
	               |	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо,
	               |	НачисленияУдержанияПоСотрудникам.Сотрудник,
	               |	НачисленияУдержанияПоСотрудникам.Организация,
	               |	НачисленияУдержанияПоСотрудникам.НачислениеУдержание
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Период,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Организация.ГоловнаяОрганизация,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Сотрудник,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Организация,
	               |	СУММА(НачисленияУдержанияПоКонтрагентамАкционерам.Сумма)
	               |ИЗ
	               |	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторы КАК Регистраторы
	               |		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = Регистраторы.Регистратор
	               |ГДЕ
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В(&ВидыНачислений)
	               |	И Регистраторы.Регистратор ЕСТЬ NULL
	               |	И (ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор) = ТИП(Документ.ВыплатаБывшимСотрудникам)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор) = ТИП(Документ.ДивидендыФизическимЛицам)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор) = ТИП(Документ.РегистрацияПрочихДоходов)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор) = ТИП(Документ.ПереносДанных))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Период,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Организация.ГоловнаяОрганизация,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Сотрудник,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.Организация,
	               |	НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1000
	               |	ДополнениеРасчетнойБазы.Регистратор КАК Регистратор,
	               |	ДополнениеРасчетнойБазы.Период КАК Период,
	               |	ДополнениеРасчетнойБазы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ДополнениеРасчетнойБазы.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ДополнениеРасчетнойБазы.Сотрудник КАК Сотрудник,
	               |	ДополнениеРасчетнойБазы.Начисление КАК Начисление,
	               |	ДополнениеРасчетнойБазы.Организация КАК Организация,
	               |	ДополнениеРасчетнойБазы.Сумма КАК Сумма
	               |ИЗ
	               |	ВТДополнениеРасчетнойБазы КАК ДополнениеРасчетнойБазы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Регистратор";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор) = ТИП(Документ.ДивидендыФизическимЛицам)", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрНакопления.ДополнениеРасчетнойБазыУдержаний.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.ДополнениеРасчетнойБазыУдержаний.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		
		Пока Выборка.Следующий() Цикл 
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
